# IsFaceReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..IsFaceReference Method
Form Class See Also
---
Tell if the pick is the reference to a face of the form.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsFaceReference(
	Reference faceReference
)
```

Visual Basic
---
```text
Public Function IsFaceReference ( _
	faceReference As Reference _
) As Boolean
```

Visual C++
---
```text
public:
bool IsFaceReference(
	Reference^ faceReference
)
```

# ### Parameters
faceReference
    Type: Autodesk.Revit.DB..::..ReferenceReference to be checked.
# See Also
Form Class
Autodesk.Revit.DB Namespace